OpenFoam/design_points/design_point_1/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
9600
(
(-3.07527 -7.47524 0.5)
(-2.82821 -7.47541 0.5)
(-2.58113 -7.47557 0.5)
(-2.33404 -7.47572 0.5)
(-2.08696 -7.47586 0.5)
(-1.83987 -7.476 0.5)
(-1.59276 -7.47613 0.5)
(-1.34566 -7.47625 0.5)
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<vector> 
160
(
(1.39698 -5.5124 0.5)
(1.41139 -5.52573 0.5)
(1.42632 -5.53847 0.5)
(1.44174 -5.55062 0.5)
(1.45762 -5.56217 0.5)
(1.47394 -5.57307 0.5)
(1.49068 -5.58332 0.5)
(1.50781 -5.59292 0.5)
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-3.13154 -7.5 0.5)
(-2.88154 -7.5 0.5)
(-2.63154 -7.5 0.5)
(-2.38154 -7.5 0.5)
(-2.13154 -7.5 0.5)
(-1.88154 -7.5 0.5)
(-1.63154 -7.5 0.5)
(-1.38154 -7.5 0.5)
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(6.61846 7.5 0.5)
(6.36846 7.5 0.5)
(6.11846 7.5 0.5)
(5.86846 7.5 0.5)
(5.61846 7.5 0.5)
(5.36846 7.5 0.5)
(5.11846 7.5 0.5)
(4.86846 7.5 0.5)
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(-15 7.3125 0.5)
(-15 6.9375 0.5)
(-15 6.5625 0.5)
(-15 6.1875 0.5)
(-15 5.8125 0.5)
(-15 5.4375 0.5)
(-15 5.0625 0.5)
(-15 4.6875 0.5)
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(15 7.3125 0.5)
(15 6.9375 0.5)
(15 6.5625 0.5)
(15 6.1875 0.5)
(15 5.8125 0.5)
(15 5.4375 0.5)
(15 5.0625 0.5)
(15 4.6875 0.5)
...
)
;
    }
}


// ************************************************************************* //
